оперативныйучет2/src/InformationRegisters/НастройкиПередачиВПереработку/НастройкиПередачиВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПередачиВПереработку</name>
  <resources>
    <name>ФормироватьДокументыПередачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкладПоступленияОтДавальца</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПереработчикПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорПереработки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОрганизацияПереаботчик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартнерДавалецСырья</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорПоступленияСырья</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

оперативныйучет2/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6982524e-4873-4f26-b5f2-355851663d52">
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76156fda-6b2e-4da7-871d-49dfc4840df3">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82c175ad-99c1-4f74-9ddb-eab46549ef7c">
    <name>ПередачаПереработчику2_5</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

оперативныйучет2/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5e0d9dd9-464c-4fa3-984a-2a2da8517f38">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="421edd92-2b38-4f12-aa73-f25cdff0897c">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5290731f-624a-4cf6-acc4-fbae69309b60">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="221a4541-2b95-440e-889b-259e07f55204">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="024fcdb1-7276-45d6-9cb9-f3b1bb21029e">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a5aaded-4c45-495d-b4fb-7037984d0f05">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ddb3a008-56c0-405b-b7a0-5dd0bffdc061">
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2daa80d9-88a7-44ee-b08b-2b622309d9ce">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79c90f60-5562-471b-b366-38c8a8868fb8">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c3c6b97e-7d9a-4a6b-8cfd-5a1d2a1e2450">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7af43f23-66b5-4041-bd23-3216b1d23915">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="49c74d36-ce0a-47f3-b6eb-899238c5cc0f">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="90669c4c-35dd-4758-a773-ac4d0128a1ed">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b183caa6-3c0c-42ed-afe1-7a98a7fa716e">
    <name>РегистрироватьЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca52f30b-148d-4746-88ef-754378b8837f">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="207653db-8f5a-4a6f-a083-453f30cfdbd7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c545b75d-dd2d-4844-903e-a04b725622b7">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67f7a26a-0201-484f-ae9c-65078d524a61">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eb8b5ad-0eec-40f5-88b2-f1412f212359">
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd906d50-e8be-4b18-b32c-c20813240936">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7b830f2-2b12-46b2-9301-c31a35ed9d63">
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a24b56df-76b0-43a1-8e72-20b0450c6ccb">
    <name>ПоступлениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe67df88-df15-4d71-84d3-5bbe41102ea1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e5758e0-b3c6-40b0-8f37-e87b287ff527">
    <name>НаименованиеВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="941aa10e-3657-48ec-8f9d-92e38e90ecbf">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6b535f05-ac01-4fbe-a57c-0c88609787de">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07770f6f-1b6b-4728-8b1e-5727c63dbf6d">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5c753858-cccc-42c3-9869-ab43bc32e5bd">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0481449e-4c15-43e4-8316-bb4b65ab27e5">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="58fc47c6-1733-47b4-bc71-2472a7a3d39b">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4707386f-be02-4153-8c0e-7f525e2f533a">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42f9ced0-acf6-4175-bd8e-e12ec6d72840">
      <name>ВидЦеныПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5d205893-d5ea-40c6-8cbf-ceb9cf788886">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6b024007-efad-421d-a44b-ffd3354f9f83">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ca71c11b-a85b-4181-8c6f-6ba2ef9b8b40">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d6572c59-9cc8-4ee3-a0dc-a0a09059d5d1">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c312e59b-ecd8-4b4a-a960-833d0bbcbd24">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fdd0758-9f70-4353-83f7-a01e7d2c08ca">
      <name>СуммаНДСВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="207d1cd1-2012-4066-b05a-4fcf5305954b">
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a4f2022c-b287-4a63-b7c2-eded9b8040ad">
      <name>НоменклатураПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a56f4f82-f8c7-4e2f-9d24-f7a744bd6e6b">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="29b2bb92-4480-41fd-8028-ae65bab73418">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

оперативныйучет2/src/Catalogs/КонтрольнаяТочка/КонтрольнаяТочка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтрольнаяТочка</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>МастерТочки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТочки</name>
    <type>
      <types>EnumRef.ТипыКонтрольныхТочек</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Весы</name>
    <type>
      <types>CatalogRef.ВесыКонтрольныхТочек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьОстаткиМатериалов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыДляПеремещения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаВыпуска</name>
    <attributes>
      <name>Страница</name>
      <type>
        <types>CatalogRef.СтраницыФорм</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполнятьКолонкуПланПоСпецификации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладыПолучатели</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладыОтправители</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

оперативныйучет2/src/CommonModules/оуп_ПриемПродукцииСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции
// Форимрует новый документ приобретения
Функция СформироватьДокументПриобретения(ДанныеЗаполнения, Товары)

	документ = документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	Документ.Дата = ТекущаяДатаСеанса();
	документ.Заполнить(Неопределено);
	Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ЗаполнитьЗначенияСвойств(документ, ДанныеЗаполнения);
	
	Документ.Контрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(Документ.Партнер);
	Документ.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
	

	ПараметрыЗаполнения = Документы.ПриобретениеТоваровУслуг.ПараметрыЗаполненияНалогообложенияНДСЗакупки(Документ);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(Документ.НалогообложениеНДС, ПараметрыЗаполнения, Неопределено);
	
	ПараметрыЗаполнения = Документы.ПриобретениеТоваровУслуг.ПараметрыЗаполненияВидаДеятельностиНДС(Документ);
	
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(Документ.ЗакупкаПодДеятельность, ПараметрыЗаполнения, неопределено);
	
	Документ.ВариантПриемкиТоваров = ЗакупкиСервер.ПолучитьВариантПриемкиТоваров();;

	
	для Каждого строкаТовар из товары Цикл 
		СтрокаДокумента = документ.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, строкаТовар);
		//@skip-check unknown-method-property
		СтрокаДокумента.СтавкаНДС = СтрокаДокумента.Номенклатура.СтавкаНДС;
		СтрокаДокумента.Склад = документ.Склад;
		СтрокаДокумента.КоличествоУпаковок = СтрокаДокумента.Количество;
		СтрокаДокумента.Сумма = строкаТовар.Сумма ;
	КонецЦикла;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВТЧ(документ);
	
	СтруктураДействий = новый Структура;
	ПараметрыУказанияСерий = документы.ПриобретениеТоваровУслуг.ПараметрыУказанияСерий(Документ); 
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", 
		ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Документ));
    СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВЗакупках",  
    	ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВЗакупкахВТЧ(
    		Документ, Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
    	)
    );
    		
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", 
		Новый Структура("Склад, ПараметрыУказанияСерий", Документ.Склад, ПараметрыУказанияСерий)
	);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);    
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);

	СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа",
	 Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
		документ.ПоступлениеПоЗаказам, документ.ТребуетсяЗалогЗаТару)
	);

	////СтруктураДействий.Вставить("ПересчитатьСумму");
	//СтруктураДействий.Вставить("ПересчитатьЦену");


		
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Документ.Товары, СтруктураДействий, Неопределено);

	
	Документ.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	Возврат документ;
КонецФункции // СформироватьДокументПриобретения()

Функция СписокДоступныхОрганизацийКТ(КонтрольнаяТочка) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПередачиВПереработку.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.НастройкиПередачиВПереработку КАК НастройкиПередачиВПереработку
		|ГДЕ
		|	НастройкиПередачиВПереработку.ФормироватьДокументыПередачи
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтрольнаяТочка.Организация
		|ИЗ
		|	Справочник.КонтрольнаяТочка КАК КонтрольнаяТочка
		|ГДЕ
		|	КонтрольнаяТочка.Ссылка = &КонтрольнаяТочка";

	запрос.УстановитьПараметр("КонтрольнаяТочка", КонтрольнаяТочка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");


КонецФункции // СписокДоступныхОрганизацийКТ()

// Структура для заполнения документа
//@skip-check doc-comment-export-function-return-section
Функция СтруктураДанныхПриобретение()  Экспорт 

	//@skip-check structure-consructor-too-many-keys

	//@skip-check structure-consructor-too-many-keys
	Возврат Новый Структура("Партнер, Организация, Договор, Склад, НомерВходящегоДокумента, ДатаВходящегоДокумента, ЦенаВключаетНДС, РегистрироватьЦеныПоставщика"
	);	

КонецФункции // СтруктураДанныхПриобретение()

//@skip-check function-should-return-value
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПровестиПакетДокументовПоступления(Параметры, АдресРезультата)  Экспорт 

	
	УстановитьПривилегированныйРежим(истина);
	 
	Попытка
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	    ДокументПриобретения = СформироватьДокументПриобретения(Параметры.ДанныеЗаполнения, Параметры.Товары);	
		ДокументПриобретения.ДополнительныеСвойства.Вставить("СинхронизироватьПриЗаписи");	
		ДокументПриобретения.Записать(РежимЗаписиДокумента.Проведение);
		
		//ПередачаВПереработку.СформироватьПриходныйОрдерНаТовары( ДокументПриобретения, Параметры.Товары, новый Массив);
		
		ПоместитьВоВременноеХранилище(ДокументПриобретения.Ссылка, АдресРезультата);	
		если ТранзакцияАктивна() Тогда 
			ЗафиксироватьТранзакцию();
		иначе 
			ВызватьИсключение "Транзакция не активка!";
		КонецЕсли;
		
	Исключение
		если ТранзакцияАктивна() Тогда 
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("ФормированиеПриобретений", УровеньЖурналаРегистрации.Ошибка, ,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Сообщение = Новый СообщениеПользователю;
		//@skip-check object-deprecated
		Сообщение.Текст = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
		//@skip-check object-deprecated
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	

	

КонецФункции // ПровестиПакетДокументовПоступления()

#КонецОбласти
